JoDaNl/esp32-smartdisplay-demo-AXS15231B-dev/lib/esp32-smartdisplay/src/lvgl_panel_axs15231b.c
#ifdef BLABLA
static lv_indev_t *bsp_display_indev_init(const bsp_display_cfg_t *config, lv_disp_t *disp)
{
    BSP_ERROR_CHECK_RETURN_NULL(bsp_touch_new(config, &tp));
    assert(tp);

    /* Add touch input (for selected screen) */
    const lvgl_port_touch_cfg_t touch_cfg = {
        .disp = disp,
        .handle = tp,
        .touch_wait_cb = bsp_touch_sync_cb,
    };

    return lvgl_port_add_touch(&touch_cfg);
}
#endif // BLABLA

#endif //  BOARD_HAS_TOUCH

#ifdef BLABLA
lv_disp_t *bsp_display_start_with_config(const bsp_display_cfg_t *cfg)
{
//    BSP_ERROR_CHECK_RETURN_NULL(lvgl_port_init(&cfg->lvgl_port_cfg));

//     BSP_ERROR_CHECK_RETURN_NULL(bsp_display_brightness_init());

    BSP_NULL_CHECK(disp = bsp_display_lcd_init(cfg), NULL);

//    BSP_NULL_CHECK(disp_indev = bsp_display_indev_init(cfg, disp), NULL);

    return disp;
}
#endif

lv_indev_t *bsp_display_get_input_dev(void)
{
    return disp_indev;
}

#ifdef BLABLA
bool bsp_display_lock(uint32_t timeout_ms)
{
    return lvgl_port_lock(timeout_ms);
}

void bsp_display_unlock(void)
{
    lvgl_port_unlock();
}
#endif



// wrapper functions for esp32_smartdisplay lib

/**
 * Set the rotation degree:
 *      - 0: 0 degree
 *      - 90: 90 degree
 *      - 180: 180 degree
 *      - 270: 270 degree
 *
 */

#define LVGL_PORT_ROTATION_DEGREE               (270)

uint16_t flush_cnt = 0; // JOS : keep track of nr of flushes...after last flush, flush_cnt is ZERO

bool axs15231b_color_trans_done(esp_lcd_panel_io_handle_t panel_io, esp_lcd_panel_io_event_data_t *edata, void *user_ctx)
{
    lv_disp_drv_t *drv = user_ctx;
    lv_disp_flush_ready(drv);

    return false;
}


static void axs15231b_lv_flush(lv_disp_drv_t *drv, const lv_area_t *area, lv_color_t *color_map)
{
    esp_lcd_panel_handle_t panel_handle = drv->user_data;
#if LV_COLOR_16_SWAP != 1
#warning "LV_COLOR_16_SWAP should be 1 for max performance"
    ushort pixels = lv_area_get_size(area);
    lv_color16_t *p = color_map;
    while (pixels--)
        p++->full = (uint16_t)((p->full >> 8) | (p->full << 8));
#endif

    flush_cnt++;
    if (lv_disp_flush_is_last(drv))
    {
        flush_cnt = 0;
    }
    
    ESP_ERROR_CHECK(esp_lcd_panel_draw_bitmap(panel_handle, area->x1, area->y1, area->x2 + 1, area->y2 + 1, color_map));
    lv_disp_flush_ready(drv);
};




// JOS - test rounder function
void rounder_cb(lv_disp_drv_t * disp_drv, lv_area_t * area)
{
    printf("JOS - round x1=%03d, y1=%03d, x2=%03d, y2=%03d\n", area->x1, area->y1, area->x2, area->y2);
    return;

    area->x1 = 0;
    area->x2 = disp_drv->hor_res-1;
    area->y1 = 0;
    area->y2 = disp_drv->ver_res=1;
}

void lvgl_lcd_init(lv_disp_drv_t *drv)
{
    log_v("drv:0x%08x");

#ifdef BLABLA
    bsp_display_cfg_t cfg = 
    {
        .lvgl_port_cfg = ESP_LVGL_PORT_INIT_CONFIG(),
        .buffer_size = EXAMPLE_LCD_QSPI_H_RES * EXAMPLE_LCD_QSPI_V_RES,
#if LVGL_PORT_ROTATION_DEGREE == 90
        .rotate = LV_DISP_ROT_90,
#elif LVGL_PORT_ROTATION_DEGREE == 270
        .rotate = LV_DISP_ROT_270,
#elif LVGL_PORT_ROTATION_DEGREE == 180
        .rotate = LV_DISP_ROT_180,
#elif LVGL_PORT_ROTATION_DEGREE == 0
        .rotate = LV_DISP_ROT_NONE,
#endif
    };
#endif

    // esp_lcd_panel_io_handle_t *ret_io;

    printf("JOS - EXAMPLE_LCD_QSPI_H_RES=%d\n", EXAMPLE_LCD_QSPI_H_RES);
    printf("JOS - EXAMPLE_LCD_QSPI_V_RES=%d\n", EXAMPLE_LCD_QSPI_V_RES);

    // bsp_display_start_with_config(&cfg);
    // disp = bsp_display_lcd_init(&cfg);

    // Hardware rotation is supported
    drv->sw_rotate = 0;
    drv->rotated = LV_DISP_ROT_NONE;
    
    drv->full_refresh = 1; // JOS : required as partional/windows mechanism is not working
//    drv->rounder_cb = rounder_cb; // JOS

    uint32_t max_transfer_sz = EXAMPLE_LCD_QSPI_H_RES * EXAMPLE_LCD_QSPI_V_RES * sizeof(uint16_t);
    
    max_transfer_sz = sizeof(lv_color_t) * LVGL_BUFFER_PIXELS; // JOS

    // Create SPI bus
    ESP_LOGI(TAG, "Initialize SPI bus");

    // const spi_bus_config_t buscfg = AXS15231B_PANEL_BUS_QSPI_CONFIG(
    //                                     EXAMPLE_PIN_NUM_QSPI_PCLK,
    //                                     EXAMPLE_PIN_NUM_QSPI_DATA0,
    //                                     EXAMPLE_PIN_NUM_QSPI_DATA1,
    //                                     EXAMPLE_PIN_NUM_QSPI_DATA2,
    //                                     EXAMPLE_PIN_NUM_QSPI_DATA3,
    //                                     max_transfer_sz);

    const spi_bus_config_t buscfg =
    {
      .sclk_io_num = EXAMPLE_PIN_NUM_QSPI_PCLK,
      .data0_io_num = EXAMPLE_PIN_NUM_QSPI_DATA0,
      .data1_io_num = EXAMPLE_PIN_NUM_QSPI_DATA1,
      .data2_io_num = EXAMPLE_PIN_NUM_QSPI_DATA2,
      .data3_io_num = EXAMPLE_PIN_NUM_QSPI_DATA3,
      .data4_io_num = -1,
      .data5_io_num = -1,
      .data6_io_num = -1,
      .data7_io_num = -1,
      .max_transfer_sz = max_transfer_sz,
      .flags = SPICOMMON_BUSFLAG_MASTER // JOS : may also be 0 ?       
    };



    ESP_ERROR_CHECK(spi_bus_initialize(EXAMPLE_LCD_QSPI_HOST, &buscfg, SPI_DMA_CH_AUTO));

    ESP_LOGI(TAG, "Install panel IO");
    
    // Attach the LCD controller to the SPI bus

//    const esp_lcd_panel_io_spi_config_t io_spi_config = AXS15231B_PANEL_IO_QSPI_CONFIG(EXAMPLE_PIN_NUM_QSPI_CS, axs15231b_color_trans_done, drv);
    const esp_lcd_panel_io_spi_config_t io_spi_config = {
        .cs_gpio_num = EXAMPLE_PIN_NUM_QSPI_CS,                                      
        .dc_gpio_num = -1,                                      
        .spi_mode = 3,
        .pclk_hz = 40 * 1000 * 1000,
        .trans_queue_depth = 10,                                
        .on_color_trans_done = axs15231b_color_trans_done,                              
        .user_ctx = drv,                                     
        .lcd_cmd_bits = 32,                                     
        .lcd_param_bits = 8,                                    
        .flags = 
        {                                              
          .quad_mode = true,                                  
        }
    };   


    // Attach the LCD to the SPI bus
    esp_lcd_panel_io_handle_t io_handle;    
    ESP_ERROR_CHECK(esp_lcd_new_panel_io_spi((esp_lcd_spi_bus_handle_t)EXAMPLE_LCD_QSPI_HOST, &io_spi_config, &io_handle));

    ESP_LOGI(TAG, "Install LCD driver of axs15231b");

    const axs15231b_vendor_config_t vendor_config = 
    {
        .init_cmds = lcd_init_cmds,
        .init_cmds_size = sizeof(lcd_init_cmds) / sizeof(lcd_init_cmds[0]),
        .flags = 
        {
            .use_qspi_interface = 1,
        },
    };

    const esp_lcd_panel_dev_config_t panel_dev_config = 
    {
        .reset_gpio_num = EXAMPLE_PIN_NUM_QSPI_RST,
        .rgb_ele_order = LCD_RGB_ELEMENT_ORDER_RGB,
        .bits_per_pixel = BSP_LCD_BITS_PER_PIXEL,
        .vendor_config = (void *) &vendor_config,
    };

    esp_lcd_panel_handle_t panel_handle;

    ESP_ERROR_CHECK(esp_lcd_new_panel_axs15231b(io_handle, &panel_dev_config, &panel_handle));
    ESP_ERROR_CHECK(esp_lcd_panel_reset(panel_handle));
    ESP_ERROR_CHECK(esp_lcd_panel_init(panel_handle));
    ESP_ERROR_CHECK(esp_lcd_panel_disp_on_off(panel_handle, false));

    drv->user_data = panel_handle;
    drv->flush_cb = axs15231b_lv_flush;

}


// #endif // DISPLAY_AXS15231B_QSPI
